## Ordinal number Encoding

In [1]:
import datetime

In [5]:
today_date = datetime.datetime.today()

In [6]:
today_date

datetime.datetime(2023, 1, 10, 14, 27, 44, 275755)

In [7]:
today_date-datetime.timedelta(1)

datetime.datetime(2023, 1, 9, 14, 27, 44, 275755)

In [9]:
# List comprehension
days = [today_date-datetime.timedelta(x) for x in range(0,15)]

In [17]:
import pandas as pd
data = pd.DataFrame(days)
data.columns=["Day"]
data.head()

                         Day
0 2023-01-10 14:27:44.275755
1 2023-01-09 14:27:44.275755
2 2023-01-08 14:27:44.275755
3 2023-01-07 14:27:44.275755
4 2023-01-06 14:27:44.275755

In [33]:
data['weekday']=data['Day'].dt.day_name()

In [34]:
data.head()

                         Day   weekday
0 2023-01-10 14:27:44.275755   Tuesday
1 2023-01-09 14:27:44.275755    Monday
2 2023-01-08 14:27:44.275755    Sunday
3 2023-01-07 14:27:44.275755  Saturday
4 2023-01-06 14:27:44.275755    Friday

In [35]:
dictionary = {
    'Monday':1,
    'Tuesday':2,
    'Wednesday':3,
    'Thursday':4,
    'Friday':5,
    'Saturday':6,
    'Sunday':7
}

In [36]:
dictionary

{'Monday': 1,
 'Tuesday': 2,
 'Wednesday': 3,
 'Thursday': 4,
 'Friday': 5,
 'Saturday': 6,
 'Sunday': 7}

In [38]:
data['weekday_ordinal']=data['weekday'].map(dictionary)

In [40]:
data

                          Day    weekday  weekday_ordinal
0  2023-01-10 14:27:44.275755    Tuesday                2
1  2023-01-09 14:27:44.275755     Monday                1
2  2023-01-08 14:27:44.275755     Sunday                7
3  2023-01-07 14:27:44.275755   Saturday                6
4  2023-01-06 14:27:44.275755     Friday                5
5  2023-01-05 14:27:44.275755   Thursday                4
6  2023-01-04 14:27:44.275755  Wednesday                3
7  2023-01-03 14:27:44.275755    Tuesday                2
8  2023-01-02 14:27:44.275755     Monday                1
9  2023-01-01 14:27:44.275755     Sunday                7
10 2022-12-31 14:27:44.275755   Saturday                6
11 2022-12-30 14:27:44.275755     Friday                5
12 2022-12-29 14:27:44.275755   Thursday                4
13 2022-12-28 14:27:44.275755  Wednesday                3
14 2022-12-27 14:27:44.275755    Tuesday                2

## Count or Frequency Encoding

In [78]:
train_set = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data' , header = None,index_col=None)
train_set.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [79]:
train_set[1].unique()

array([' State-gov', ' Self-emp-not-inc', ' Private', ' Federal-gov',
       ' Local-gov', ' ?', ' Self-emp-inc', ' Without-pay',
       ' Never-worked'], dtype=object)

In [80]:
train_set[1].value_counts()

 Private             22696
 Self-emp-not-inc     2541
 Local-gov            2093
 ?                    1836
 State-gov            1298
 Self-emp-inc         1116
 Federal-gov           960
 Without-pay            14
 Never-worked            7
Name: 1, dtype: int64

In [81]:
columns = [1,3,5,6,7,8,9,13]

In [82]:
train_set = train_set[columns]

In [83]:
train_set.columns = ['Employment','Degree','Status','Designation','family_job','Race','Sex','Country']

In [84]:
train_set.head(10)

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba
5,Private,Masters,Married-civ-spouse,Exec-managerial,Wife,White,Female,United-States
6,Private,9th,Married-spouse-absent,Other-service,Not-in-family,Black,Female,Jamaica
7,Self-emp-not-inc,HS-grad,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
8,Private,Masters,Never-married,Prof-specialty,Not-in-family,White,Female,United-States
9,Private,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States

In [85]:
for feature in train_set.columns:
    print(feature,":",len(train_set[feature].unique()),"labels")

Employment : 9 labels
Degree : 16 labels
Status : 7 labels
Designation : 15 labels
family_job : 6 labels
Race : 5 labels
Sex : 2 labels
Country : 42 labels

In [86]:
country_map = train_set['Country'].value_counts().to_dict()

In [87]:
train_set['Country'] = train_set['Country'].map(country_map)
train_set.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95

## Advantages
1.Easy To Use

2.Not increasing feature space

## Disadvantages

3.It will provide same weight if the frequencies are same

## Target Guided Ordinal Encoding

1.Ordering the labels according to the target

2.Replace the labels by the joint probability of being 1 or 0

In [117]:
import pandas as pd
df = pd.read_csv('titanic.csv',usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [118]:
df['Cabin'].fillna("Missing",inplace=True)
df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [119]:
df['Cabin'] = df['Cabin'].astype(str).str[0]

In [120]:
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [121]:
df['Cabin'].unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [122]:
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [123]:
df.groupby(['Cabin'])['Survived'].mean().sort_values().index

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [124]:
ordinal_labels = df.groupby(['Cabin'])['Survived'].mean().sort_values().index
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [125]:
enumerate(ordinal_labels)

In [126]:
ordinal_label = {k:i for i,k in enumerate(ordinal_labels,0)}
ordinal_label

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [127]:
df['Cabin_ordinal_labels'] = df['Cabin'].map(ordinal_label)
df.head()

   Survived Cabin  Cabin_ordinal_labels
0         0     M                     1
1         1     C                     4
2         1     M                     1
3         1     C                     4
4         0     M                     1

### Mean Encoding

In [131]:
df.groupby(['Cabin'])['Survived'].mean().to_dict()

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29985443959243085,
 'T': 0.0}

In [132]:
mean_ordinal = df.groupby(['Cabin'])['Survived'].mean().to_dict()

In [133]:
df['mean_ordinal_encode'] = df['Cabin'].map(mean_ordinal)

In [135]:
df.head()

   Survived Cabin  Cabin_ordinal_labels  mean_ordinal_encode
0         0     M                     1             0.299854
1         1     C                     4             0.593220
2         1     M                     1             0.299854
3         1     C                     4             0.593220
4         0     M                     1             0.299854